Repository: OsamaAlrwajbeh/AlResala
Catalog: Resources/SharedResource.*.resx
Languages: ar

source: About Us
ar: عن مدارس الرسالة

source: Academic Specialization
ar: التخصص

source: Administration
ar: مجلس الإدارة

# Admission
source: ADMISSIONS
ar: القبول والتسجيل

# AdmissionInfo
source: Admission and registration information in Al-Resala schools
ar: معلومات القبول والتسجيل في مدارس الرسالة

source: Applying for a job
ar: التقدم لوظيفة

# AreInterested
source: For those interested in working in Al-Resala Schools, please send your resume with a personal photo attached to our e-mail, or send a request in the employment application form
ar: للمهتمين بالعمل في مدارس الرسالة الرجاء ارسال السيرة الذاتية مرفقة بصورة شخصية إلى البريد الالكتروني الخاص بنا أو إرسال طلب في النموذج الخاص بطلب التوظيف

source: Choose the job
ar: اختر الوظيفة

source: Contact Form
ar: نموذج الإتصال

source: Contact us
ar: تواصل معنا

source: Country of Residence
ar: بلد الإقامة

source: Current job
ar: الوظيفة الحالية

# CV
source: Curriculum Vitae
ar: السيرة الذاتية

source: Date of Birth
ar: تاريخ الميلاد

# DescriptionGallery
source: Learn about the facilities in Al-Resala Schools
ar: تعرف على المرافق في مدارس الرسالة

source: Developed By
ar: طور بواسطة

# DivisionsDescription
source: Divisions in the message schools
ar: الأقسام في مدارس الرسالة

source: Email
ar: البريد الالكتروني

source: Full Name
ar: الأسم

source: Gallery
ar: معرض الصور

# Graduation
source: Graduation rate
ar: المعدل

source: home
ar: الرئيسية

source: Message
ar: الرسالة

source: more details
ar: تفاصيل أكثر

source: More Read
ar: إقرأ المزيد

source: Nationality
ar: الجنسية

source: Our team
ar: فريق العمل

source: Phone
ar: التلفون

# rightTxt
source: All rights reserved to Al-Resala School
ar: جميع الحقوق محفوظة مدرسة الرسالة

# Selary
source: The required salary
ar: الراتب المطلوب

source: Submit
ar: إرسال

source: The More
ar: المزيد

source: The news more
ar: المزيد من الأخبار

# TitleContactUs
source: You can contact us through one of the communication channels or by filling out the form
ar: بإمكانكم التواصل معنا عبر إحدى قنوات التواصل او عبر تعبئة النموذج

# TypeOfJob
source: The type of job required
ar: نوع الوظيفة المطلوبة

# Universcity
source: University
ar: الجامعة

source: Vision And Mission
ar: الرؤية والرسالة

source: Years of Experience
ar: عدد سنوات الخبرة
